You have to work on the files:
*  [Books](https://github.com/gdv/foundationsCS/raw/master/progetti/2021/Books.csv.gz)
*  [Book ratings](https://github.com/gdv/foundationsCS/raw/master/progetti/2021/Book-Ratings.csv.gz)
*  [Users](https://github.com/gdv/foundationsCS/raw/master/progetti/2021/Users.csv.gz)
*  [Goodbooks books](https://github.com/gdv/foundationsCS/raw/master/progetti/2021/goodbooks.csv.gz)
*  [Goodbooks ratings](https://github.com/gdv/foundationsCS/raw/master/progetti/2021/goodbooks-ratings.csv.gz)

### Notes

1.    It is mandatory to use GitHub for developing the project.
1.    The project must be a jupyter notebook.
1.    There is no restriction on the libraries that can be used, nor on the Python version.
1.    To read those files, you need to use the `encoding = 'latin-1'` option.
1.    All questions on the project **must** be asked in a public channel on [Zulip](https://focs.zulipchat.com), otherwise no  answer will be given.

Libreria importata: Pandas.

In [1]:
import pandas as pd

Carichiamo i dataset utili al progetto.

In [2]:
books = pd.read_csv('https://raw.githubusercontent.com/lucasammarini/FCSProject/master/Books.csv', sep = ';', encoding = 'latin-1', low_memory=False)
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [3]:
books_ratings = pd.read_csv('https://raw.githubusercontent.com/lucasammarini/FCSProject/master/Book-Ratings.csv', sep = ';', encoding = 'latin-1')
books_ratings.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [4]:
users = pd.read_csv('https://raw.githubusercontent.com/lucasammarini/FCSProject/master/Users.csv', sep = ';', encoding = 'latin-1')
users.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [5]:
goodbooks = pd.read_csv('https://raw.githubusercontent.com/lucasammarini/FCSProject/master/goodbooks.csv', encoding = 'latin-1')
goodbooks.head()

,book_id,goodreads_book_id,best_book_id,work_id,books_count,isbn,isbn13,authors,original_publication_year,original_title,...,ratings_count,work_ratings_count,work_text_reviews_count,ratings_1,ratings_2,ratings_3,ratings_4,ratings_5,image_url,small_image_url
0,1,2767052,2767052,2792775,272,439023483,9.780439e+12,Suzanne Collins,2008.0,The Hunger Games,...,4780653,4942365,155254,66715,127936,560092,1481305,2706317,https://images.gr-assets.com/books/1447303603m...,https://images.gr-assets.com/books/1447303603s...
1,2,3,3,4640799,491,439554934,9.780440e+12,"J.K. Rowling, Mary GrandPrÃ©",1997.0,Harry Potter and the Philosopher's Stone,...,4602479,4800065,75867,75504,101676,455024,1156318,3011543,https://images.gr-assets.com/books/1474154022m...,https://images.gr-assets.com/books/1474154022s...
2,3,41865,41865,3212258,226,316015849,9.780316e+12,Stephenie Meyer,2005.0,Twilight,...,3866839,3916824,95009,456191,436802,793319,875073,1355439,https://images.gr-assets.com/books/1361039443m...,https://images.gr-assets.com/books/1361039443s...
3,4,2657,2657,3275794,487,61120081,9.780061e+12,Harper Lee,1960.0,To Kill a Mockingbird,...,3198671,3340896,72586,60427,117415,446835,1001952,1714267,https://images.gr-assets.com/books/1361975680m...,https://images.gr-assets.com/books/1361975680s...
4,5,4671,4671,245494,1356,743273567,9.780743e+12,F. Scott Fitzgerald,1925.0,The Great Gatsby,...,2683664,2773745,51992,86236,197621,606158,936012,947718,https://images.gr-assets.com/books/1490528560m...,https://images.gr-assets.com/books/1490528560s...

In [6]:
goodbooks_ratings = pd.read_csv('https://raw.githubusercontent.com/lucasammarini/FCSProject/master/goodbooks-ratings.csv', encoding = 'latin-1')
goodbooks_ratings.head()

   user_id  book_id  rating
0        1      258       5
1        2     4081       4
2        2      260       5
3        2     9296       5
4        2     2318       3

### 1. Normalize the location field of *Users* dataset, splitting into city, region, country.

Utilizziamo il metodo _split_ per suddividere la colonna __Location__.

In [7]:
users['Location'].str.split(',', expand=True)

,0,1,2,3,4,5,6,7,8
0,nyc,new york,usa,None,None,None,None,None,None
1,stockton,california,usa,None,None,None,None,None,None
2,moscow,yukon territory,russia,None,None,None,None,None,None
3,porto,v.n.gaia,portugal,None,None,None,None,None,None
4,farnborough,hants,united kingdom,None,None,None,None,None,None
...,...,...,...,...,...,...,...,...,...
278853,portland,oregon,usa,None,None,None,None,None,None
278854,tacoma,washington,united kingdom,None,None,None,None,None,None
278855,brampton,ontario,canada,None,None,None,None,None,None
278856,knoxville,tennessee,usa,None,None,None,None,None,None
278857,dublin,n/a,ireland,None,None,None,None,None,None

Dall'output si osserva che in alcuni casi il campo __Location__ viene suddiviso in più di 3 colonne. Ci chiediamo quante siano le osservazioni suddivise in più di 3 colonne.

In [8]:
len(users[users['Location'].str.split(',', expand=True).notnull()[3]]['Location'])

1508

Vediamo che questi valori rappresentano circa lo 0.5% dei valori totali. Procediamo quindi a rimuoverli.

In [9]:
clean_users = users[users['Location'].str.split(',', expand=True)[3].isnull()]
clean_users.drop(columns='User-ID', inplace=True)
clean_users.head()

C:\Users\lsamm\AppData\Local\Temp\ipykernel_7088\3554149610.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  clean_users.drop(columns='User-ID', inplace=True)

                             Location   Age
0                  nyc, new york, usa   NaN
1           stockton, california, usa  18.0
2     moscow, yukon territory, russia   NaN
3           porto, v.n.gaia, portugal  17.0
4  farnborough, hants, united kingdom   NaN

Possiamo ora suddividere la colonna __Location__ in 3.

In [10]:
clean_users[['City','Region','Country']] = clean_users['Location'].str.split(',', expand=True)
clean_users.head()

C:\Users\lsamm\AppData\Local\Temp\ipykernel_7088\2974736435.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  clean_users[['City','Region','Country']] = clean_users['Location'].str.split(',', expand=True)
C:\Users\lsamm\AppData\Local\Temp\ipykernel_7088\2974736435.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  clean_users[['City','Region','Country']] = clean_users['Location'].str.split(',', expand=True)
C:\Users\lsamm\AppData\Local\Temp\ipykernel_7088\2974736435.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  clean_users[['City','Region','Country']] = clean_users['Location'].str.split(',', expand=True)

,Location,Age,City,Region,Country
0,"nyc, new york, usa",NaN,nyc,new york,usa
1,"stockton, california, usa",18.0,stockton,california,usa
2,"moscow, yukon territory, russia",NaN,moscow,yukon territory,russia
3,"porto, v.n.gaia, portugal",17.0,porto,v.n.gaia,portugal
4,"farnborough, hants, united kingdom",NaN,farnborough,hants,united kingdom

In [11]:
clean_users.tail()

,Location,Age,City,Region,Country
278853,"portland, oregon, usa",NaN,portland,oregon,usa
278854,"tacoma, washington, united kingdom",50.0,tacoma,washington,united kingdom
278855,"brampton, ontario, canada",NaN,brampton,ontario,canada
278856,"knoxville, tennessee, usa",NaN,knoxville,tennessee,usa
278857,"dublin, n/a, ireland",NaN,dublin,n/a,ireland

### 2. For each book in the *Books* dataset, compute its average rating.

Tramite la funzione _merge_ uniamo i dataset __books__ e __books_ratings__, successivamente raggruppiamo per Titolo e ISBN e facciamo la media. Infine, per rendere più chiaro il dataset, rinominiamo la colonna con le medie.

In [12]:
books_avg_rating=books.merge(books_ratings, how='left', on='ISBN').groupby(['Book-Title','ISBN'],as_index=False)[['Book-Rating']].mean()
books_avg_rating.rename(columns = {'Book-Rating':'Avg-Rating'}, inplace = True)
books_avg_rating.head()

                                          Book-Title        ISBN  Avg-Rating
0   A Light in the Storm: The Civil War Diary of ...  0590567330        2.25
1                              Always Have Popsicles  0964147726        0.00
2               Apple Magic (The Collector's series)  0942320093        0.00
3   Ask Lily (Young Women of Faith: Lily Series, ...  0310232546        8.00
4   Beyond IBM: Leadership Marketing and Finance ...  0962295701        0.00

### 3. For each book in the *GoodBooks* dataset, compute its average rating.

Proponiamo due soluzioni alla query in questione.
1) Esiste già la colonna, quindi:

In [13]:
goodbooks[['title','isbn','average_rating']]

,title,isbn,average_rating
0,"The Hunger Games (The Hunger Games, #1)",439023483,4.34
1,Harry Potter and the Sorcerer's Stone (Harry P...,439554934,4.44
2,"Twilight (Twilight, #1)",316015849,3.57
3,To Kill a Mockingbird,61120081,4.25
4,The Great Gatsby,743273567,3.89
...,...,...,...
94,The Picture of Dorian Gray,375751513,4.06
95,"Fifty Shades Freed (Fifty Shades, #3)",345803507,3.88
96,Dracula,393970124,3.98
97,"The Girl Who Played with Fire (Millennium, #2)",307269981,4.22
98,"Fifty Shades Darker (Fifty Shades, #2)",1612130585,3.87

2) Calcoliamo la media aritmetica creando la colonna __computed_avg_rating__, sommando i rating in maniera pesata.

In [14]:
goodbooks['computed_avg_rating'] = (goodbooks['ratings_1']+goodbooks['ratings_2']*2+goodbooks['ratings_3']*3+goodbooks['ratings_4']*4+goodbooks['ratings_5']*5)/goodbooks['work_ratings_count']

Confrontiamo i risultati delle due soluzioni. Osserviamo che i valori sono coincidenti.

In [15]:
goodbooks[['title','isbn','average_rating','computed_avg_rating']]

,title,isbn,average_rating,computed_avg_rating
0,"The Hunger Games (The Hunger Games, #1)",439023483,4.34,4.341984
1,Harry Potter and the Sorcerer's Stone (Harry P...,439554934,4.44,4.443047
2,"Twilight (Twilight, #1)",316015849,3.57,3.571067
3,To Kill a Mockingbird,61120081,4.25,4.254818
4,The Great Gatsby,743273567,3.89,3.887376
...,...,...,...,...
94,The Picture of Dorian Gray,375751513,4.06,4.055317
95,"Fifty Shades Freed (Fifty Shades, #3)",345803507,3.88,3.879526
96,Dracula,393970124,3.98,3.976401
97,"The Girl Who Played with Fire (Millennium, #2)",307269981,4.22,4.220469
98,"Fifty Shades Darker (Fifty Shades, #2)",1612130585,3.87,3.868840

### 4. Merge together all rows sharing the same book title, author and publisher. We will call the resulting dataset `merged books`. The books that have not been merged together will not appear in `merged books`.

Inizialmente raggruppiamo le righe per Titolo, Autore e Editore, e contiamo, tramite la funzione _count_, quante istanze condividono gli stessi valori in questi 3 campi. Generiamo così un nuovo dataset. Manteniamo nel dataset creato solo i valori che si ripetono più di una volta, così facendo eliminiamo i libri che non sono stati uniti. Infine resettiamo l'indice per agevolare la lettura del dataset.

In [16]:
merged_books = books.groupby(['Book-Title','Book-Author','Publisher'],as_index=False).count()
merged_books = merged_books[merged_books['ISBN']>1][['Book-Title','Book-Author','Publisher']]
merged_books.reset_index(inplace=True, drop=True)
merged_books.head()

,Book-Title,Book-Author,Publisher
0,!%@ (A Nutshell handbook),Donnalyn Frey,O'Reilly
1,'A Hell of a Place to Lose a Cow': An American...,Tim Brookes,National Geographic
2,"10,000 dreams interpreted: A dictionary of dreams",Gustavus Hindman Miller,Barnes &amp; Nobles Books
3,101 Famous Poems,Roy J. Cook,McGraw-Hill/Contemporary Books
4,15 Houseplants Even You Can't Kill,Joe Elder,Berkley Pub Group

### 5. For each book in `merged books` compute its average rating.

The average is computed considering all books in `books` that have been merged.

Inizialmente uniamo, tramite la funzione _merge_, il dataset __books__ e il dataset __books_ratings__, raggruppando le righe per Titolo, Autore ed Editore e calcolandone la media. Inseriamo il risultato di queste operazioni in un nuovo dataset chiamato __books_ratings_merged__.

Successivamente uniamo il dataset appena creato con il dataset creato al punto 4, __merged_books__, avendo così, per ogni libro in __merged_books__, la media dei voti.

In [17]:
books_ratings_merged = books.merge(books_ratings, how='left', on='ISBN').groupby(['Book-Title','Book-Author','Publisher'], as_index=False)['Book-Rating'].mean()
books_ratings_merged.rename(columns = {'Book-Rating':'Avg-Book-Rating'}, inplace = True)
merged_books_avg = merged_books.merge(books_ratings_merged, how='left', on=['Book-Title','Book-Author','Publisher'])
merged_books_avg.head()

,Book-Title,Book-Author,Publisher,Avg-Book-Rating
0,!%@ (A Nutshell handbook),Donnalyn Frey,O'Reilly,3.000000
1,'A Hell of a Place to Lose a Cow': An American...,Tim Brookes,National Geographic,1.888889
2,"10,000 dreams interpreted: A dictionary of dreams",Gustavus Hindman Miller,Barnes &amp; Nobles Books,7.000000
3,101 Famous Poems,Roy J. Cook,McGraw-Hill/Contemporary Books,3.833333
4,15 Houseplants Even You Can't Kill,Joe Elder,Berkley Pub Group,0.000000

### 6. For each book in `merged books` compute the minimum and maximum of the average ratings over all corresponding books in the `books` dataset.

Hence for each book in `merged books` we will have exactly two values (a minimum and a maximum)

Inizialmente uniamo, tramite la funzione _merge_, il dataset __books__ e il dataset __books_ratings__, raggruppando le righe per Titolo, Autore, Editore e ISBN e calcolandone la media. In questo caso abbiamo raggruppato anche per ISBN, allo scopo di calcolare la media per ogni edizione di un libro (contraddistinta dall'ISBN). Inseriamo il risultato di queste operazioni in un nuovo dataset chiamato __books_ratings_merged_ISBN__.

Successivamente uniamo il dataset appena creato con il dataset creato al punto 4, __merged_books__, avendo così, per ogni libro in __merged_books__, la media dei voti per ogni ISBN. Creiamo poi due colonne, __Max-Rating__ e __Min-Rating__, nelle quali inseriamo, per ogni combinazione di Titolo, Autore ed Editore, il voto minimo e il voto massimo calcolato sull'ISBN.

In [18]:
books_ratings_merged_ISBN = books.merge(books_ratings, how='left', on='ISBN').groupby(['Book-Title','Book-Author','Publisher','ISBN'], as_index=False)['Book-Rating'].mean()
merged_books_avg_ISBN = merged_books.merge(books_ratings_merged_ISBN, on=['Book-Title','Book-Author','Publisher'])
merged_books['Max-Rating'] = merged_books_avg_ISBN.groupby(['Book-Title','Book-Author','Publisher'], as_index=False).max()['Book-Rating']
merged_books['Min-Rating'] = merged_books_avg_ISBN.groupby(['Book-Title','Book-Author','Publisher'], as_index=False).min()['Book-Rating']
merged_books.head()

,Book-Title,Book-Author,Publisher,Max-Rating,Min-Rating
0,!%@ (A Nutshell handbook),Donnalyn Frey,O'Reilly,6.00,0.000000
1,'A Hell of a Place to Lose a Cow': An American...,Tim Brookes,National Geographic,3.40,0.000000
2,"10,000 dreams interpreted: A dictionary of dreams",Gustavus Hindman Miller,Barnes &amp; Nobles Books,7.25,6.666667
3,101 Famous Poems,Roy J. Cook,McGraw-Hill/Contemporary Books,5.00,0.000000
4,15 Houseplants Even You Can't Kill,Joe Elder,Berkley Pub Group,0.00,0.000000

### 7. For each book in `goodbooks`, compute the list of its authors. Assuming that the number of reviews with a text (column `work_text_reviews_count`) is split equally among all authors, find for each authors the total number of reviews with a text. We will call this quantity the *shared number of reviews with a text*.

Prima di tutto, tramite la funzione _split_, suddividiamo la colonna __authors__ ad ogni virgola. Generiamo così una colonna, __authors_list__, contenente per ogni libro un vettore di stringhe con i nomi degli autori.

Utilizziamo la lunghezza dei vettori generati, ottenuta tramite _apply(len)_, per calcolare il numero di recensioni per ogni autore (__shared_number_of_reviews_with_a_text__).

Successivamente generiamo una riga per ogni autore tramite _explode_, con lo scopo di poter raggruppare le righe per autore e sommare il numero di recensioni per ogni autore.

In [19]:
goodbooks['authors_list'] = goodbooks['authors'].str.split(',')
goodbooks['shared_number_of_reviews_with_a_text'] = goodbooks['work_text_reviews_count']/goodbooks['authors_list'].apply(len)
goodbooks_authors_exploded = goodbooks.explode('authors_list',ignore_index=True)
goodbooks_authors_exploded.groupby(['authors_list'], as_index=False).sum('shared_number_of_reviews_with_a_text')[['authors_list','shared_number_of_reviews_with_a_text']].head(37)

                 authors_list  shared_number_of_reviews_with_a_text
0              Alan R. Clarke                          27890.500000
1     B.M. Mooyaart-Doubleday                           6941.666667
2                Bernard Knox                           1620.200000
3               CelÃ¢l Ãster                          15172.666667
4               David J. Skal                           5754.333333
5          Dom Marcos Barbosa                           6134.250000
6                   E.V. Rieu                           1620.200000
7           Eleanor Roosevelt                           6941.666667
8                 Erich Fromm                          15172.666667
9           FrÃ©dÃ©ric Mugler                           1620.200000
10             Garth Williams                           4348.000000
11            Gregory Rabassa                          10835.500000
12               Guy Cardwell                           4149.333333
13       Hablot Knight Browne                           4364.333333
14          Jeffrey Eugenides                           9823.500000
15                John Seelye                           4149.333333
16               Louis Sachar                           7916.000000
17              Marion Wiesel                          11000.500000
18             Mary GrandPrÃ©                         136668.000000
19             Maurice Hindle                           6664.333333
20           Melina Karakosta                           6134.250000
21              Michael Mason                          15606.000000
22              Nina Auerbach                           5754.333333
23       Percy Bysshe Shelley                           6664.333333
24                Reg Keeland                          46983.000000
25             Richard Howard                           6134.250000
26            Richard J. Dunn                          13078.500000
27            Richard Maxwell                           4364.333333
28   Robert           Jackson                           7389.000000
29              Robert Fagles                           1620.200000
30              Ros Ballaster                           3842.000000
31             Rosemary Wells                           4348.000000
32                 Rufus Beck                          12033.000000
33          Stephen J. Dubner                           6834.000000
34                Tony Tanner                           3842.000000
35              Aldous Huxley                          20095.000000
36               Alice Sebold                          36642.000000

Dall'output notiamo che l'ordine alfabetico ricomincia alla linea 35, un motivo di questo potrebbe essere che nell'utilizzo della funzione _split_ siano rimasti gli spazi antecedenti i termini successivi al primo in ogni lista.

Verifichiamo quindi questa ipotesi.

In [20]:
goodbooks_authors_exploded['authors_list'][2]

' Mary GrandPrÃ©'

Attraverso la funzione _strip_ eliminiamo gli spazi in eccesso.

In [21]:
goodbooks_authors_exploded['authors_list'] = goodbooks_authors_exploded['authors_list'].str.strip()
goodbooks_authors_exploded.groupby(['authors_list'], as_index=False).sum('shared_number_of_reviews_with_a_text')[['authors_list','shared_number_of_reviews_with_a_text']].head()

                authors_list  shared_number_of_reviews_with_a_text
0             Alan R. Clarke                          27890.500000
1              Aldous Huxley                          20095.000000
2               Alice Sebold                          36642.000000
3                 Anne Frank                           6941.666667
4  Antoine de Saint-ExupÃ©ry                           6134.250000

### 8. For each year of publication, determine the author that has the largest value of the shared number of reviews with a text.

Per ogni anno e autore calcoliamo la somma delle recensioni. Successivamente per ogni anno troviamo l'autore con più recensioni.

In [22]:
goodbooks_authors_sum_per_year = goodbooks_authors_exploded.groupby(['original_publication_year','authors_list']).sum()
goodbooks_authors_sum_per_year.loc[goodbooks_authors_sum_per_year.groupby(['original_publication_year']).idxmax()['shared_number_of_reviews_with_a_text']]['shared_number_of_reviews_with_a_text'].head()

original_publication_year  authors_list
-720.0                     Bernard Knox                    1620.200000
 1595.0                    Robert           Jackson        7389.000000
 1811.0                    Jane Austen                     3842.000000
 1813.0                    Jane Austen                    49152.000000
 1818.0                    Mary Wollstonecraft Shelley     6664.333333
Name: shared_number_of_reviews_with_a_text, dtype: float64

### 9. Assuming that there are no errors in the ISBN fields, find the books in both datasets, and compute the difference of average rating according to the ratings and the goodratings datasets

Dopo aver unito il dataset __goodbooks__ con il dataset __books_avg_rating__, creato al punto 2, calcoliamo la differenza tra i voti medi dei due dataset (__average_rating__ e __Avg-Rating__). Osserviamo che la scala di valutazione usata nei due dataset è differente; in __books_ratings__ la scala di valutazione è da 0 a 10, mentre in __goodbooks__ è da 0 a 5. Perciò dividiamo per 2 i voti in __books_avg_rating__.

Per rendere più chiaro il risultato rinominiamo le colonne tramite la funzione _rename_.

In [45]:
books_total = books_avg_rating.merge(goodbooks, left_on='ISBN', right_on='isbn')
books_total['Dif'] = books_total['average_rating']-books_total['Avg-Rating']/2
books_total.rename(columns={'Avg-Rating':'Books-Average-Rating','average_rating':'Goodbooks-Average-Rating'}, inplace=True)
books_total[['ISBN','Book-Title','Books-Average-Rating', 'Goodbooks-Average-Rating', 'Dif']].head()

,ISBN,Book-Title,Books-Average-Rating,Goodbooks-Average-Rating,Dif
0,014028009X,Bridget Jones's Diary,3.751852,3.75,1.874074
1,043965548X,Harry Potter and the Prisoner of Azkaban (Harr...,3.533333,4.53,2.763333
2,1400032717,The Curious Incident of the Dog in the Night-T...,4.813187,3.85,1.443407
3,1594480001,The Kite Runner,2.400000,4.26,3.060000
4,014038572X,The Outsiders (Now in Speak!),4.460674,4.06,1.829663

### 10. Split the users dataset according to the age. One dataset contains the users with unknown age, one with age 0-14, one with age 15-24, one with age 25-34, and so on.

Inizialmente cerchiamo il valore di età massimo.

In [24]:
users.iloc[users['Age'].idxmax()]

User-ID                                      20857
Location    stuttgart, baden-wuerttemberg, germany
Age                                          244.0
Name: 20856, dtype: object

Tramite la funzione _cut_ suddiviamo l'età in diversi range. Utilizziamo come valore minimo -0.01 in modo da includere anche lo 0 nel primo range.

Poichè nel dataset sono presenti persone con età superiore a 104 anni, creiamo una categoria apposita denominata __more-than-104__.

In [25]:
users['Age-Range'] = pd.cut(users['Age'], [-0.01,14,24,34,44,54,64,74,84,94,104,users['Age'].max()], labels=['0-14','15-24','25-34','35-44','45-54','55-64','65-74','75-84','85-94','95-104','more-than-104'])
users.head()

   User-ID                            Location   Age Age-Range
0        1                  nyc, new york, usa   NaN       NaN
1        2           stockton, california, usa  18.0     15-24
2        3     moscow, yukon territory, russia   NaN       NaN
3        4           porto, v.n.gaia, portugal  17.0     15-24
4        5  farnborough, hants, united kingdom   NaN       NaN

Creiamo un dataset con gli utenti con età sconosciuta.

In [26]:
users_unk_age = users[users['Age-Range'].isnull()]
users_unk_age.head()

   User-ID                            Location  Age Age-Range
0        1                  nyc, new york, usa  NaN       NaN
2        3     moscow, yukon territory, russia  NaN       NaN
4        5  farnborough, hants, united kingdom  NaN       NaN
6        7                 washington, dc, usa  NaN       NaN
7        8            timmins, ontario, canada  NaN       NaN

Creiamo i dataset suddividendo gli utenti con età nota in base al range.

Come verifica stampiamo uno dei dataset creati.

In [27]:
users_0_14 = users[users['Age-Range'] == '0-14']
users_15_24 = users[users['Age-Range'] == '15-24']
users_25_34 = users[users['Age-Range'] == '25-34']
users_35_44 = users[users['Age-Range'] == '35-44']
users_45_54 = users[users['Age-Range'] == '45-54']
users_55_64 = users[users['Age-Range'] == '55-64']
users_65_74 = users[users['Age-Range'] == '65-74']
users_75_84 = users[users['Age-Range'] == '75-84']
users_85_94 = users[users['Age-Range'] == '85-94']
users_95_104 = users[users['Age-Range'] == '95-104']
users_more_than_104 = users[users['Age-Range'] == 'more-than-104']
users_more_than_104.head()

      User-ID                                 Location    Age      Age-Range
1578     1579             akure, ondo/nigeria, nigeria  231.0  more-than-104
3210     3211  le mesnil saint denis, yvelines, france  119.0  more-than-104
8329     8330      newcastle, thenorth, united kingdom  114.0  more-than-104
8457     8458                 milano, lombardia, italy  230.0  more-than-104
8781     8782                 calgary, alberta, canada  239.0  more-than-104

### 11. Find the books that appear only in the goodbooks datasets.

Tramite la funzione _isin_ verifichiamo se gli ISBN dei libri presenti in __goodbooks__ sono presenti anche in __books__.

In [28]:
goodbooks[goodbooks['isbn'].isin(books['ISBN'])==False][['title','authors']].head()

,title,authors
0,"The Hunger Games (The Hunger Games, #1)",Suzanne Collins
1,Harry Potter and the Sorcerer's Stone (Harry P...,"J.K. Rowling, Mary GrandPrÃ©"
2,"Twilight (Twilight, #1)",Stephenie Meyer
3,To Kill a Mockingbird,Harper Lee
4,The Great Gatsby,F. Scott Fitzgerald

### 12. Assuming that each pair (author, title) identifies a book, for each book find the number of times it appears in the books dataset. Which books appear the most times?

Raggruppiamo i libri per Titolo e Autore e, tramite _count_, contiamo quante volte appare ogni coppia. Ordiniamo in ordine decrescente i libri in base al numero di apparizioni.

In [29]:
books_ntimes = books.groupby(['Book-Title','Book-Author'],as_index=False).count().sort_values('ISBN', ascending=False)[['Book-Title','Book-Author','ISBN']].reset_index(drop=True)
books_ntimes.rename(columns={'ISBN':'Appearance'}, inplace=True)
books_ntimes.head()

                       Book-Title              Book-Author  Appearance
0                    Little Women        Louisa May Alcott          21
1               Wuthering Heights             Emily Bronte          20
2  Adventures of Huckleberry Finn               Mark Twain          20
3             Pride and Prejudice              Jane Austen          18
4               The Secret Garden  Frances Hodgson Burnett          16

In [30]:
books_ntimes.loc[books_ntimes['Appearance'].idxmax()]

Book-Title          Little Women
Book-Author    Louisa May Alcott
Appearance                    21
Name: 0, dtype: object

### 13. Find the author with the highest average rating according to the goodbooks datasets.

Tramite le funzioni _idxmax_ e _loc_, otteniamo la riga con il valore medio di voti più alto.

In [31]:
goodbooks_highest_average = goodbooks.loc[goodbooks['average_rating'].idxmax()][['authors','title','average_rating']]
goodbooks_highest_average.head()

authors                                J.K. Rowling, Mary GrandPrÃ©
title             Harry Potter and the Deathly Hallows (Harry Po...
average_rating                                                 4.61
Name: 24, dtype: object